; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v8)
             (pred_9 ?v11 ?v9)
             (pred_2 ?v5 ?v9)
             (pred_6 ?v13 ?v5 )
	     (pred_3 ?v5)
             (pred_11 ?v1)
             (pred_10 ?v11)
             (pred_1 ?v9)
             (pred_4 ?v5)
             (pred_7 ?v11)
             (pred_12 ?v5)
             (pred_5 ))



(:action op_5
:parameters (?v12 ?v6 ?v7 ?v3)
:precondition (and (pred_11 ?v12) (pred_11 ?v6) (pred_10 ?v7) (pred_1 ?v3)
          (pred_8 ?v12 ?v6) (pred_9 ?v7 ?v3)
                   (pred_2 ?v6 ?v3) (pred_3 ?v12) 
                   (pred_4 ?v6) (pred_7 ?v7))
:effect (and  (pred_12 ?v6) (not (pred_4 ?v6))))


(:action op_4
:parameters (?v12 ?v10)
:precondition (and (pred_11 ?v12) (pred_11 ?v10)
               (pred_3 ?v12) (pred_8 ?v12 ?v10) (pred_12 ?v10))
:effect (and (pred_3 ?v10) (not (pred_3 ?v12))))

(:action op_1
:parameters (?v12 ?v7)
:precondition (and (pred_11 ?v12) (pred_10 ?v7) 
                  (pred_3 ?v12) (pred_6 ?v7 ?v12) (pred_5 ))
:effect (and (pred_7 ?v7)
   (not (pred_6 ?v7 ?v12)) (not (pred_5 ))))


(:action op_3
:parameters (?v12 ?v2 ?v4)
:precondition (and (pred_11 ?v12) (pred_10 ?v2) (pred_10 ?v4)
                  (pred_3 ?v12) (pred_7 ?v4) (pred_6 ?v2 ?v12))
:effect (and (pred_7 ?v2) (pred_6 ?v4 ?v12)
        (not (pred_7 ?v4)) (not (pred_6 ?v2 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_11 ?v12) (pred_10 ?v7) 
                  (pred_3 ?v12) (pred_7 ?v7))
:effect (and (pred_5 ) (pred_6 ?v7 ?v12) (not (pred_7 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_03 obj_05 obj_06 obj_10 obj_11 obj_17 obj_18 obj_20 obj_01 obj_08 obj_02 obj_04 obj_19 obj_14 obj_21
    obj_16 obj_22 obj_13
    obj_12 obj_15 obj_07
    )

    (:init
       (pred_5)

       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_06)
       (pred_11 obj_10)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_11 obj_01)
       (pred_11 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_04)
       (pred_11 obj_19)
       (pred_11 obj_14)
       (pred_11 obj_21)
       (pred_1 obj_16)
       (pred_1 obj_22)
       (pred_1 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_07)

       (pred_8 obj_09 obj_10)
       (pred_8 obj_09 obj_03)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_05)
       (pred_8 obj_03 obj_09)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_10 obj_20)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_11 obj_17)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_17 obj_11)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_20 obj_10)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_04 obj_19)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_19 obj_04)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_14)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_2  obj_04 obj_16)
       (pred_2  obj_17 obj_22)
       (pred_2  obj_14 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_19)
       (pred_12 obj_21)

       (pred_9  obj_12 obj_16)
       (pred_9  obj_15 obj_22)
       (pred_9  obj_07 obj_13)
       (pred_6 obj_12 obj_10)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_07 obj_18)
       (pred_3 obj_08)
    )

    (:goal (and
       (pred_6 obj_07 obj_03)
    ))
(:constraints
  (always (not (pred_3 obj_02)))
)
)

; plan
1. (op_4 obj_08 obj_01)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_01)
   goals met: 0 of 1
2. (op_4 obj_01 obj_11)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_03)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_03)
   goals met: 0 of 1
4. (op_4 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_05)
   goals met: 0 of 1
5. (op_4 obj_05 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_18)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_18)
   goals met: 0 of 1
7. (op_1 obj_18 obj_07)
   deleted: (pred_6 obj_07 obj_18) (pred_5)
   added: (pred_7 obj_07)
   goals met: 0 of 1
8. (op_4 obj_18 obj_06)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_06)
   goals met: 0 of 1
9. (op_4 obj_06 obj_05)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_05)
   goals met: 0 of 1
10. (op_4 obj_05 obj_03)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_03)
   goals met: 0 of 1
11. (op_2 obj_03 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_5) (pred_6 obj_07 obj_03)
   goals met: 1 of 1
